; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.5
; Author:       Jared Breland <jbreland@legroom.net>
; Homepage:     http://www.legroom.net/mysoft
; Russian file: AVV_UA
;
; Translation Instructions:
;       Copy this file to a new file named after the new language
;               Eg: A language file for the German language would be named German.ini.
;       Replace the English words and phrases with their native equivalents,
;               attempting to match the English phrasing and case-sensitivity as
;               closely as possible for the sake of consistency
;       Update the Author and Homepage information at the top of your new language
;               file.  Simply delete the Homepage line if you don't have one.
;       E-mail new language files to jbreland@legroom.net for inclusion in main
;               Universal Extractor installer
;
;       The following symbols have special meanings:
;       & - when used in a GUI label or button, it precedes the letter that will
;               be registered as a "hotkey" for that function
;       %n - indicates a newline character, which will be replaced when displayed
;       %t - indicates a tab character, which will be replaced when displayed
;       %s - indicates a string variable that UniExtract will replace when displayed
;               The contents each %s variables is hardocded into UniExtract.
;               The order and number of %s variables is very important and should not
;               be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&OK"
CANCEL_BUT = "&Отмена"
MAIN_DEST_DIR_LABEL = "&Папка назначения:"
MAIN_FILE_LABEL = "&Архив/Инсталлятор, который нужно распаковать:"
MENU_FILE_LABEL = "&Файл"
MENU_FILE_QUIT_LABEL = "&Выход"
MENU_EDIT_LABEL = "&Правка"
MENU_EDIT_PREFS_LABEL = "&Предустановки"
MENU_HELP_LABEL = "&Помощь"
MENU_HELP_WEB_LABEL = "Сайт программы %s"
PREFS_TITLE_LABEL = "Предустановки"
PREFS_UNIEXTRACT_OPTS_LABEL = "Опции Universal Extractor"
PREFS_HISTORY_LABEL = "Сохранять &историю"
PREFS_FORMAT_OPTS_LABEL = "Специальные опции формата"
PREFS_LANG_LABEL = "&Язык"
PREFS_DEBUG_LABEL = "&Сохранять файл отладки в"
PREFS_WARN_EXECUTE_LABEL = "&Спросить перед запуском файлов"
PREFS_REMOVE_DUPE_LABEL = "&Удалить дубли файлов"
PREFS_REMOVE_TEMP_LABEL = "Удалить &временные файлы"
PREFS_APPEND_EXT_LABEL = "&Добавлять расширения"
METHOD_ADMIN_RADIO = "%s Административный инсталлятор"
METHOD_EXTRACTION_RADIO = "%s извлечение"
METHOD_HEADER = "%s Извлечение"
METHOD_MSI_NOTE_LABEL = "Примечание:"
METHOD_MSI_REQUIRES_LABEL = "msi2xml требует"
METHOD_MSI_URL_LABEL = "MSXML 4.0 Parser"
METHOD_RADIO_LABEL = "Метод Извлечения"
METHOD_SWITCH_RADIO = "%s Переключение"
METHOD_NOTIS_RADIO = "Это не инсталлятор InstallShield"
METHOD_TEXT_LABEL = "%s поддерживает следующие методы извлечения%s. К сожалению, ни один из этих методов не надёжен на 100 %. Если заданный по умолчанию метод не работает, пожалуйста, запустите %s ещё раз и выберите альтернативный метод."
METHOD_UNPACKER_RADIO = "%s Распаковщик"

; GUI control functions
DOES_NOT_EXIST = "не существует.%n"
EXTRACT_TO = "Извлечь в"
INVALID_DIR_SELECTED =  "%s Неверная папка."
INVALID_FILE_SELECTED = "%sПожалуйста, выберите верный файл."
OPEN_FILE = "Открыть файл"
SELECT_FILE = "Выбрать файл"
WRITE_TO = "Сохранить в"

; Common terms
TERM_ARCHIVE = "архив"
TERM_COMPRESSED = "сжатый файл"
TERM_DISK = "диск"
TERM_EBOOK = "электр. книга"
TERM_ECARD = "электр. карточка"
TERM_ENCODED = "закодиров. файл"
TERM_EXECUTABLE = "исполняемый файл"
TERM_FAILED = "неудача"
TERM_HELP = "Файл справки"
TERM_HOTFIX = "хотфикс"
TERM_IMAGE = "образ"
TERM_INSTALLER = "инсталлятор"
TERM_PACKAGE = "пакет"
TERM_PATCH = "исправление"
TERM_SFX = "Самораспаковывающийся архив"
TERM_STAGE = "Стадия"
TERM_SUCCEEDED = "следующий"
TERM_TESTING = "Тестирование"
TERM_UNKNOWN = "неизвестный"
TERM_UNPACKED = "неупакованный"
TERM_UPDATER = "обновление"

; Status messages
SCANNING_FILE = "Анализ типа файла."
SCANNING_EXE = "Анализ файла с помощью %s."
EXTRACTING = "Извлечение файлов из:"
INIT_WAIT = "Ожидание запуска инсталлятора.%nПожалуйста, подождите."

; Custom prompts
CONVERT_CDROM = "CD-образы не могут быть извлечены напрямую. Образ%nбудет преобразован в ISO-образ, который и будет извлечен.%n%nПродолжить?%nПримечание: этот процесс потребует нескольких минут."
CONVERT_CDROM_STAGE1_FAILED = "Ошибка: CD-образ не может быть преобразован.%nЕсли это BIN/CUE-образ, убедитесь в правильности формата файла CUE."
CONVERT_CDROM_STAGE2_FAILED = "Ошибка: ISO-образ был создан из %s образа, но он не может быть конвертирован.%nХотите сохранить ISO образ для дальнейшего анализа?"
CONVERT_BIN_MISSING = "Ошибка: Не найден:%n%s\%s.%s%n%nДля работы необходимы оба - %s.BIN и %s.CUE - файла."
INIT_COMPLETE = "Инициализация %s. Выйдите из инсталлятора, затем нажмите OK, чтобы продолжить."
WISE_MSI_PROMPT = "Внимание: этот метод работает только с определенными типами пакетов Windows Installer.%nЕсли Wise Installation Wizard запустится и останется в режиме ожидания, значит, этот файл не%nподдерживается. Тогда закройте инсталлятор, и %s извлечение будет прервано.%n%nПродолжить?"
UNPACK_PROMPT = "Этот файл упакован со %s сжатием, но не может быть извлечён.%nВозможно, тип файла не поддерживается, или%nпросто нет файлов, которые можно было бы извлечь.%n%nВсё равно хотите распаковывать этот файл?%n%nПримечание: Распакованный файл будет назван:%n%s\%s_unpacked.%s"
UNPACK_FAILED = "Ошибка: %s%nне может быть распакован."
WARN_EXECUTE = "Предостережение:  Для того, чтобы извлечь содержимое файлов такого типа, файл необходимо запустить.%nЕсли Вы продолжите, будет выполнена следующая команда:%n%n%s%n%nЕсли Вы предполагаете, что этому файлу не следует доверять (как malicious - "злонамеренному"), не рекомендуется продолжать.%nХотите ли Вы продолжить извлечение?"

; Help text
HELP_SUMMARY = "Извлечение файлов из архива любого типа или инсталляционного пакета."
HELP_SYNTAX = "%nИспользовать:  %s [/help] [filename [destination]]"
HELP_ARGUMENTS = "%n%nПоддерживаемые параметры:"
HELP_HELP = "%n     /справка%t%tПоказать справку"
HELP_FILENAME = "%n     имя%tИмя извлекаемого файла"
HELP_DESTINATION = "%n     адрес%tпапки для извлечения"
HELP_SUB = "%n%nПропустить /sub вместо имени папки назначения %n%s в подкаталог, названный по имени архива."
HELP_EXAMPLE1 = "%n%nПример:"
HELP_EXAMPLE2 = "%n     %s c:\1\Пример.zip c:\тест"
HELP_NOARGS = "%n%nПри запуске %s без параметров будет%nдан запрос об имени файла и папке назначения."

; Error messages
CANNOT_LOG = "%s извлечения невозможно записать в лог."
CANNOT_DEBUG = "В папке для файла отладки, "%s", запрещено сохранение.%nВместо этого файл будет записан во временную папку."
CANNOT_EXTRACT = "%s невозможно извлечь.%nТип файла: %s%n%nНажмите OK, если хотите анализировать файл, или "Отмена", чтобы выйти."
UNKNOWN_EXT = "%s%nимеет неизвестное расширение и не может быть извлечён."
INVALID_DIR = "%s%nневозможно создать. Выберите правильный адрес."
EXTRACT_FAILED = "%s не может быть извлечён.%nВозможно, это %s, который поддерживается, но извлечение неудачно.%nПодробности см. в лог-файле %s.%n%nНажмите OK, чтобы просмотреть лог-файл, или "Отмена", чтобы выйти."

[Installer]
; Components page
COMP_DOCS = "Документация и информация о лицензии"
COMP_LANG = "Языковые файлы"
COMP_ACE = "Поддержка файлов ACE"
COMP_KGB = "Поддержка файлов KGB"
COMP_PEA = "Поддержка файлов Pea"
COMP_SIT = "Поддержка файлов StuffIt"

; Preferences page
PREFS_CAPTION = "Опции программы"
PREFS_DESCRIPTION = "Какие опции Universal Extractor'а нужно установить?"
PREFS_LABEL1 = "Можно установить следующие опции по умолчанию."
PREFS_LABEL2 = "Эти опции могут быть изменены после инсталляции путём правки файла UniExtract.ini."
LANGUAGE_LABEL = "Язык по умолчанию"
DEBUG_LABEL = "Расположение файла отладки"
APPEND_EXT_LABEL = "&Добавьте отсутствующее расширение файла"
HISTORY_LABEL = "&Сохранённая история архива"
REMOVE_DUPE_LABEL = "Удалить &дубли файлов"
REMOVE_TEMP_LABEL = "Удалить &временные файлы"
WARN_EXECUTE_LABEL = "&Спрашивать перед запуском файлов"

; Tasks page
ASSOCIATE = "&Интеграция в контекстное меню  Проводника"
ASSOCIATE_FILES = "Добавить 'UniExtract &Файлы' в контекстное меню"
ASSOCIATE_HERE = "Добавить 'UniExtract &здесь' в контекстное меню"
ASSOCIATE_SUBDIR = "Добавить 'UniExtract в &папку' контекстное меню"
ASSOCIATE_FORCE = "Принудительно &ассоциировать со всеми поддерживаемыми архивными форматами"
MODIFY_PATH = "Добавить Universal Extractor в System &Path"
DESKTOP_ICON = "Создать ярлык &на рабочем столе"
QUICK_LAUNCH_ICON = "Создать ярлык &на панели быстрого запуска"
SENDTO_ICON = "Создать ярлык "Отправить...""

; Context Menu integration
EXTRACT_FILES = "UniExtract &файлы"
EXTRACT_HERE = "UniExtract &здесь"
EXTRACT_SUB = "UniExtract в &папку"
